## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "119948190" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::729164266357:distribution/E355EOO70XE75H"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E355EOO70XE75H"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ response_headers_policy_id = "a23a5bcb-9462-49c3-872f-3150f659a832" -> (known after apply)
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }


      ~ ordered_cache_behavior {
          + response_headers_policy_id = (known after apply)
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (6 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy will be destroyed
  - resource "aws_cloudfront_response_headers_policy" "security_headers_policy" {
      - etag = "E23ZP02F085DFQ" -> null
      - id   = "a23a5bcb-9462-49c3-872f-3150f659a832" -> null
      - name = "my-security-headers-policy" -> null

      - security_headers_config {

          - content_type_options {
              - override = true -> null
            }

          - frame_options {
              - frame_option = "SAMEORIGIN" -> null
              - override     = true -> null
            }

          - strict_transport_security {
              - access_control_max_age_sec = 31536000 -> null
              - include_subdomains         = true -> null
              - override                   = true -> null
              - preload                    = true -> null
            }

          - xss_protection {
              - mode_block = true -> null
              - override   = true -> null
              - protection = true -> null
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_admin will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_admin" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-admin"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "base-uri 'self'; connect-src 'self'; default-src 'self'; font-src 'self' https://fonts.gstatic.com https://use.fontawesome.com https://www.canada.ca; frame-src 'self'; img-src 'self' https://canada.ca https://wet-boew.github.io https://www.canada.ca; manifest-src 'self'; media-src 'self'; object-src 'none'; script-src 'self' 'unsafe-inline' https://ajax.googleapis.com/ajax/libs/jquery/2.2.4/jquery.js https://www.canada.ca/etc/designs/canada/wet-boew/js/wet-boew.min.js; style-src 'self' 'unsafe-inline' https://use.fontawesome.com https://www.canada.ca; worker-src 'none';"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_frontend will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_frontend" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "gc-articles-security-headers-frontend"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "base-uri 'self'; connect-src 'self'; default-src 'self'; font-src 'self' https://fonts.gstatic.com https://use.fontawesome.com https://www.canada.ca; frame-src 'self'; img-src 'self' https://canada.ca https://wet-boew.github.io https://www.canada.ca; manifest-src 'self'; media-src 'self'; object-src 'none'; script-src 'self' https://ajax.googleapis.com/ajax/libs/jquery/2.2.4/jquery.js https://www.canada.ca/etc/designs/canada/wet-boew/js/wet-boew.min.js; style-src 'self' https://use.fontawesome.com https://www.canada.ca; worker-src 'none';"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::729164266357:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::729164266357:distribution/E355EOO70XE75H"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>